Ran Plan for project: `plateng-iac-597915711542-us-east-1` dir: `terraform/plateng-iac/597915711542/us-east-1` workspace: `plateng-iac-597915711542-us-east-1`

<details><summary>Show Output</summary>

```diff
module.plateng-iac-s3-bucket.data.aws_caller_identity.current: Reading...
module.plateng-iac-s3-bucket.data.aws_region.current: Reading...
module.plateng-iac-s3-bucket.data.aws_canonical_user_id.this[0]: Reading...
module.plateng-iac-s3-bucket.data.aws_partition.current: Reading...
module.plateng-iac-s3-bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.plateng-iac-s3-bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.plateng-iac-s3-bucket.data.aws_caller_identity.current: Read complete after 0s [id=597915711542]
module.plateng-iac-s3-bucket.data.aws_canonical_user_id.this[0]: Read complete after 1s [id=6e87dd2a370330444c98e387f7e0be34e74abf45e224b8a2f348802ed60a7165]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.plateng-iac-s3-bucket.aws_s3_bucket.this[0] will be created
+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "plateng-iac-s3-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "claimed_ownership"   = "true"
          + "managed-by"          = "IacasS"
          + "platform:team"       = "plateng-iac"
          + "region"              = "us-east-1"
          + "tcss:classification" = "green"
          + "tcss:owner"          = "plateng-iac"
          + "tcss:tag-version"    = "1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.plateng-iac-s3-bucket.aws_s3_bucket_acl.this[0] will be created
+ resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.plateng-iac-s3-bucket.aws_s3_bucket_public_access_block.this[0] will be created
+ resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.plateng-iac-s3-bucket.aws_s3_bucket_versioning.this[0] will be created
+ resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p plateng-iac-597915711542-us-east-1
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://RTJ6HHJY52:4141/lock?id=yogeehhegde%252Ftest-atlantis-1746531411-1%252Fterraform%252Fplateng-iac%252F597915711542%252Fus-east-1%252Fplateng-iac-597915711542-us-east-1)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p plateng-iac-597915711542-us-east-1
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```